{
  "title": "underscore.js",
  "description": "Cheatsheet for the <a href=\"http://underscorejs.org/\">underscore.js</a> library. All the content is taken from the underscore website and was provided under their <a href=\"https://github.com/documentcloud/underscore/blob/master/LICENSE\">licence</a>.",
  "sections": [
    {
      "title": "Collections",
      "description": "Applies to Arrays and Objects",
      "items": [
        {
          "title": "each",
          "code": "_.each(list, iterator, [context])",
          "description": " Iterates over a list of elements, yielding each in turn to an iterator function. The iterator is bound to the context object, if one is passed. Each invocation of iterator is called with three arguments: (element, index, list). If list is a JavaScript object, iterator's arguments will be (value, key, list). Delegates to the native forEach function if it exists.",
          "alias": [
            "forEach"
          ]
        },
        {
          "title": "map",
          "code": "_.map(list, iterator, [context])",
          "description": " Produces a new array of values by mapping each value in list through a transformation function (iterator). If the native map method exists, it will be used instead. If list is a JavaScript object, iterator's arguments will be (value, key, list).",
          "alias": [
            "collect"
          ]
        },
        {
          "title": "reduce",
          "code": "_.reduce(list, iterator, memo, [context])",
          "description": " Also known as inject and foldl, reduce boils down a list of values into a single value. Memo is the initial state of the reduction, and each successive step of it should be returned by iterator. The iterator is passed four arguments: the memo, then the value and index (or key) of the iteration, and finally a reference to the entire list.",
          "alias": [
            "inject",
            "foldl"
          ]
        },
        {
          "title": "reduceRight",
          "code": "_.reduceRight(list, iterator, memo, [context])",
          "description": " The right-associative version of reduce. Delegates to the JavaScript 1.8 version of reduceRight, if it exists. Foldr is not as useful in JavaScript as it would be in a language with lazy evaluation.",
          "alias": [
            "foldr"
          ]
        },
        {
          "title": "find",
          "code": "_.find(list, iterator, [context])",
          "description": " Looks through each value in the list, returning the first one that passes a truth test (iterator). The function returns as soon as it finds an acceptable element, and doesn't traverse the entire list.",
          "alias": [
            "detect"
          ]
        },
        {
          "title": "filter",
          "code": "_.filter(list, iterator, [context])",
          "description": " Looks through each value in the list, returning an array of all the values that pass a truth test (iterator). Delegates to the native filter method, if it exists.",
          "alias": [
            "select"
          ]
        },
        {
          "title": "where",
          "code": "_.where(list, properties)",
          "description": " Looks through each value in the list, returning an array of all the values that contain all of the key-value pairs listed in properties.",
          "alias": []
        },
        {
          "title": "findWhere",
          "code": "_.findWhere(list, properties)",
          "description": " Looks through the list and returns the first value that matches all of the key-value pairs listed in properties.",
          "alias": []
        },
        {
          "title": "reject",
          "code": "_.reject(list, iterator, [context])",
          "description": " Returns the values in list without the elements that the truth test (iterator) passes. The opposite of filter.",
          "alias": []
        },
        {
          "title": "every",
          "code": "_.every(list, iterator, [context])",
          "description": " Returns true if all of the values in the list pass the iterator truth test. Delegates to the native method every, if present.",
          "alias": [
            "all"
          ]
        },
        {
          "title": "some",
          "code": "_.some(list, [iterator], [context])",
          "description": " Returns true if any of the values in the list pass the iterator truth test. Short-circuits and stops traversing the list if a true element is found. Delegates to the native method some, if present.",
          "alias": [
            "any"
          ]
        },
        {
          "title": "contains",
          "code": "_.contains(list, value)",
          "description": " Returns true if the value is present in the list. Uses indexOf internally, if list is an Array.",
          "alias": [
            "include"
          ]
        },
        {
          "title": "invoke",
          "code": "_.invoke(list, methodName, [*arguments])",
          "description": " Calls the method named by methodName on each value in the list. Any extra arguments passed to invoke will be forwarded on to the method invocation.",
          "alias": []
        },
        {
          "title": "pluck",
          "code": "_.pluck(list, propertyName)",
          "description": " A convenient version of what is perhaps the most common use-case for map: extracting a list of property values.",
          "alias": []
        },
        {
          "title": "max",
          "code": "_.max(list, [iterator], [context])",
          "description": " Returns the maximum value in list. If iterator is passed, it will be used on each value to generate the criterion by which the value is ranked.",
          "alias": []
        },
        {
          "title": "min",
          "code": "_.min(list, [iterator], [context])",
          "description": " Returns the minimum value in list. If iterator is passed, it will be used on each value to generate the criterion by which the value is ranked.",
          "alias": []
        },
        {
          "title": "sortBy",
          "code": "_.sortBy(list, iterator, [context])",
          "description": " Returns a sorted copy of list, ranked in ascending order by the results of running each value through iterator. Iterator may also be the string name of the property to sort by (eg. length).",
          "alias": []
        },
        {
          "title": "groupBy",
          "code": "_.groupBy(list, iterator, [context])",
          "description": " Splits a collection into sets, grouped by the result of running each value through iterator. If iterator is a string instead of a function, groups by the property named by iterator on each of the values.",
          "alias": []
        },
        {
          "title": "countBy",
          "code": "_.countBy(list, iterator, [context])",
          "description": " Sorts a list into groups and returns a count for the number of objects in each group. Similar to groupBy, but instead of returning a list of values, returns a count for the number of values in that group.",
          "alias": []
        },
        {
          "title": "shuffle",
          "code": "_.shuffle(list)",
          "description": " Returns a shuffled copy of the list, using a version of the Fisher-Yates shuffle.",
          "alias": []
        },
        {
          "title": "toArray",
          "code": "_.toArray(list)",
          "description": " Converts the list (anything that can be iterated over), into a real Array. Useful for transmuting the arguments object.",
          "alias": []
        },
        {
          "title": "size",
          "code": "_.size(list)",
          "description": " Return the number of values in the list.",
          "alias": []
        }
      ]
    },
    {
      "title": "Arrays",
      "description": "Note: All array functions will also work on the arguments object. However, Underscore functions are not designed to work on \"sparse\" arrays",
      "items": [
        {
          "title": "first",
          "code": "_.first(array, [n])",
          "description": " Returns the first element of an array. Passing n will return the first n elements of the array.",
          "alias": [
            "head"
          ]
        },
        {
          "title": "initial",
          "code": "_.initial(array, [n])",
          "description": " Returns everything but the last entry of the array. Especially useful on the arguments object. Pass n to exclude the last n elements from the result.",
          "alias": []
        },
        {
          "title": "last",
          "code": "_.last(array, [n])",
          "description": " Returns the last element of an array. Passing n will return the last n elements of the array.",
          "alias": []
        },
        {
          "title": "rest",
          "code": "_.rest(array, [index])",
          "description": " Returns the rest of the elements in an array. Pass an index to return the values of the array from that index onward.",
          "alias": [
            "tail",
            "drop"
          ]
        },
        {
          "title": "compact",
          "code": "_.compact(array)",
          "description": " Returns a copy of the array with all falsy values removed. In JavaScript, false, null, 0, \"\", undefined and NaN are all falsy.",
          "alias": []
        },
        {
          "title": "flatten",
          "code": "_.flatten(array, [shallow])",
          "description": " Flattens a nested array (the nesting can be to any depth). If you pass shallow, the array will only be flattened a single level.",
          "alias": []
        },
        {
          "title": "without",
          "code": "_.without(array, [*values])",
          "description": " Returns a copy of the array with all instances of the values removed.",
          "alias": []
        },
        {
          "title": "union",
          "code": "_.union(*arrays)",
          "description": " Computes the union of the passed-in arrays: the list of unique items, in order, that are present in one or more of the arrays.",
          "alias": []
        },
        {
          "title": "intersection",
          "code": "_.intersection(*arrays)",
          "description": " Computes the list of values that are the intersection of all the arrays. Each value in the result is present in each of the arrays.",
          "alias": []
        },
        {
          "title": "difference",
          "code": "_.difference(array, *others)",
          "description": " Similar to without, but returns the values from array that are not present in the other arrays.",
          "alias": []
        },
        {
          "title": "uniq",
          "code": "_.uniq(array, [isSorted], [iterator])",
          "description": " Produces a duplicate-free version of the array, using === to test object equality. If you know in advance that the array is sorted, passing true for isSorted will run a much faster algorithm. If you want to compute unique items based on a transformation, pass an iterator function.",
          "alias": [
            "unique"
          ]
        },
        {
          "title": "zip",
          "code": "_.zip(*arrays)",
          "description": " Merges together the values of each of the arrays with the values at the corresponding position. Useful when you have separate data sources that are coordinated through matching array indexes. If you're working with a matrix of nested arrays, zip.apply can transpose the matrix in a similar fashion.",
          "alias": []
        },
        {
          "title": "object",
          "code": "_.object(list, [values])",
          "description": " Converts arrays into objects. Pass either a single list of [key, value] pairs, or a list of keys, and a list of values.",
          "alias": []
        },
        {
          "title": "indexOf",
          "code": "_.indexOf(array, value, [isSorted])",
          "description": " Returns the index at which value can be found in the array, or -1 if value is not present in the array. Uses the native indexOf function unless it's missing. If you're working with a large array, and you know that the array is already sorted, pass true for isSorted to use a faster binary search ... or, pass a number as the third argument in order to look for the first matching value in the array after the given index.",
          "alias": []
        },
        {
          "title": "lastIndexOf",
          "code": "_.lastIndexOf(array, value, [fromIndex])",
          "description": " Returns the index of the last occurrence of value in the array, or -1 if value is not present. Uses the native lastIndexOf function if possible. Pass fromIndex to start your search at a given index.",
          "alias": []
        },
        {
          "title": "sortedIndex",
          "code": "_.sortedIndex(list, value, [iterator], [context])",
          "description": " Uses a binary search to determine the index at which the value should be inserted into the list in order to maintain the list's sorted order. If an iterator is passed, it will be used to compute the sort ranking of each value, including the value you pass.",
          "alias": []
        },
        {
          "title": "range",
          "code": "_.range([start], stop, [step])",
          "description": " A function to create flexibly-numbered lists of integers, handy for each and map loops. start, if omitted, defaults to 0; step defaults to 1. Returns a list of integers from start to stop, incremented (or decremented) by step, exclusive.",
          "alias": []
        }
      ]
    },
    {
      "title": "Functions",
      "items": [
        {
          "title": "bind",
          "code": "_.bind(function, object, [*arguments])",
          "description": " Bind a function to an object, meaning that whenever the function is called, the value of this will be the object. Optionally, pass arguments to the function to pre-fill them, also known as partial application.",
          "alias": []
        },
        {
          "title": "bindAll",
          "code": "_.bindAll(object, [*methodNames])",
          "description": " Binds a number of methods on the object, specified by methodNames, to be run in the context of that object whenever they are invoked. Very handy for binding functions that are going to be used as event handlers, which would otherwise be invoked with a fairly useless this. If no methodNames are provided, all of the object's function properties will be bound to it.",
          "alias": []
        },
        {
          "title": "partial",
          "code": "_.partial(function, [*arguments])",
          "description": " Partially apply a function by filling in any number of its arguments, without changing its dynamic this value. A close cousin of bind.",
          "alias": []
        },
        {
          "title": "memoize",
          "code": "_.memoize(function, [hashFunction])",
          "description": " Memoizes a given function by caching the computed result. Useful for speeding up slow-running computations. If passed an optional hashFunction, it will be used to compute the hash key for storing the result, based on the arguments to the original function. The default hashFunction just uses the first argument to the memoized function as the key.",
          "alias": []
        },
        {
          "title": "delay",
          "code": "_.delay(function, wait, [*arguments])",
          "description": " Much like setTimeout, invokes function after wait milliseconds. If you pass the optional arguments, they will be forwarded on to the function when it is invoked.",
          "alias": []
        },
        {
          "title": "defer",
          "code": "_.defer(function, [*arguments])",
          "description": " Defers invoking the function until the current call stack has cleared, similar to using setTimeout with a delay of 0. Useful for performing expensive computations or HTML rendering in chunks without blocking the UI thread from updating. If you pass the optional arguments, they will be forwarded on to the function when it is invoked.",
          "alias": []
        },
        {
          "title": "throttle",
          "code": "_.throttle(function, wait)",
          "description": " Creates and returns a new, throttled version of the passed function, that, when invoked repeatedly, will only actually call the original function at most once per every wait milliseconds. Useful for rate-limiting events that occur faster than you can keep up with.",
          "alias": []
        },
        {
          "title": "debounce",
          "code": "_.debounce(function, wait, [immediate])",
          "description": " Creates and returns a new debounced version of the passed function that will postpone its execution until after wait milliseconds have elapsed since the last time it was invoked. Useful for implementing behavior that should only happen after the input has stopped arriving. For example: rendering a preview of a Markdown comment, recalculating a layout after the window has stopped being resized, and so on.",
          "alias": []
        },
        {
          "title": "once",
          "code": "_.once(function)",
          "description": " Creates a version of the function that can only be called one time. Repeated calls to the modified function will have no effect, returning the value from the original call. Useful for initialization functions, instead of having to set a boolean flag and then check it later.",
          "alias": []
        },
        {
          "title": "after",
          "code": "_.after(count, function)",
          "description": " Creates a version of the function that will only be run after first being called count times. Useful for grouping asynchronous responses, where you want to be sure that all the async calls have finished, before proceeding.",
          "alias": []
        },
        {
          "title": "wrap",
          "code": "_.wrap(function, wrapper)",
          "description": " Wraps the first function inside of the wrapper function, passing it as the first argument. This allows the wrapper to execute code before and after the function runs, adjust the arguments, and execute it conditionally.",
          "alias": []
        },
        {
          "title": "compose",
          "code": "_.compose(*functions)",
          "description": " Returns the composition of a list of functions, where each function consumes the return value of the function that follows. In math terms, composing the functions f(), g(), and h() produces f(g(h())).",
          "alias": []
        }
      ]
    },
    {
      "title": "Object Functions",
      "items": [
        {
          "title": "keys",
          "code": "_.keys(object)",
          "description": " Retrieve all the names of the object's properties.",
          "alias": []
        },
        {
          "title": "values",
          "code": "_.values(object)",
          "description": " Return all of the values of the object's properties.",
          "alias": []
        },
        {
          "title": "pairs",
          "code": "_.pairs(object)",
          "description": " Convert an object into a list of [key, value] pairs.",
          "alias": []
        },
        {
          "title": "invert",
          "code": "_.invert(object)",
          "description": " Returns a copy of the object where the keys have become the values and the values the keys. For this to work, all of your object's values should be unique and string serializable.",
          "alias": []
        },
        {
          "title": "functions",
          "code": "_.functions(object)",
          "description": " Returns a sorted list of the names of every method in an object — that is to say, the name of every function property of the object.",
          "alias": [
            "methods"
          ]
        },
        {
          "title": "extend",
          "code": "_.extend(destination, *sources)",
          "description": " Copy all of the properties in the source objects over to the destination object, and return the destination object. It's in-order, so the last source will override properties of the same name in previous arguments.",
          "alias": []
        },
        {
          "title": "pick",
          "code": "_.pick(object, *keys)",
          "description": " Return a copy of the object, filtered to only have values for the whitelisted keys (or array of valid keys).",
          "alias": []
        },
        {
          "title": "omit",
          "code": "_.omit(object, *keys)",
          "description": " Return a copy of the object, filtered to omit the blacklisted keys (or array of keys).",
          "alias": []
        },
        {
          "title": "defaults",
          "code": "_.defaults(object, *defaults)",
          "description": " Fill in null and undefined properties in object with values from the defaults objects, and return the object. As soon as the property is filled, further defaults will have no effect.",
          "alias": []
        },
        {
          "title": "clone",
          "code": "_.clone(object)",
          "description": " Create a shallow-copied clone of the object. Any nested objects or arrays will be copied by reference, not duplicated.",
          "alias": []
        },
        {
          "title": "tap",
          "code": "_.tap(object, interceptor)",
          "description": " Invokes interceptor with the object, and then returns object. The primary purpose of this method is to \"tap into\" a method chain, in order to perform operations on intermediate results within the chain.",
          "alias": []
        },
        {
          "title": "has",
          "code": "_.has(object, key)",
          "description": " Does the object contain the given key? Identical to object.hasOwnProperty(key), but uses a safe reference to the hasOwnProperty function, in case it's been overridden accidentally.",
          "alias": []
        },
        {
          "title": "isEqual",
          "code": "_.isEqual(object, other)",
          "description": " Performs an optimized deep comparison between the two objects, to determine if they should be considered equal.",
          "alias": []
        },
        {
          "title": "isEmpty",
          "code": "_.isEmpty(object)",
          "description": " Returns true if object contains no values.",
          "alias": []
        },
        {
          "title": "isElement",
          "code": "_.isElement(object)",
          "description": " Returns true if object is a DOM element.",
          "alias": []
        },
        {
          "title": "isArray",
          "code": "_.isArray(object)",
          "description": " Returns true if object is an Array.",
          "alias": []
        },
        {
          "title": "isObject",
          "code": "_.isObject(value)",
          "description": " Returns true if value is an Object. Note that JavaScript arrays and functions are objects, while (normal) strings and numbers are not.",
          "alias": []
        },
        {
          "title": "isArguments",
          "code": "_.isArguments(object)",
          "description": " Returns true if object is an Arguments object.",
          "alias": []
        },
        {
          "title": "isFunction",
          "code": "_.isFunction(object)",
          "description": " Returns true if object is a Function.",
          "alias": []
        },
        {
          "title": "isString",
          "code": "_.isString(object)",
          "description": " Returns true if object is a String.",
          "alias": []
        },
        {
          "title": "isNumber",
          "code": "_.isNumber(object)",
          "description": " Returns true if object is a Number (including NaN).",
          "alias": []
        },
        {
          "title": "isFinite",
          "code": "_.isFinite(object)",
          "description": " Returns true if object is a finite Number.",
          "alias": []
        },
        {
          "title": "isBoolean",
          "code": "_.isBoolean(object)",
          "description": " Returns true if object is either true or false.",
          "alias": []
        },
        {
          "title": "isDate",
          "code": "_.isDate(object)",
          "description": " Returns true if object is a Date.",
          "alias": []
        },
        {
          "title": "isRegExp",
          "code": "_.isRegExp(object)",
          "description": " Returns true if object is a RegExp.",
          "alias": []
        },
        {
          "title": "isNaN",
          "code": "_.isNaN(object)",
          "description": " Returns true if object is NaN. Note: this is not the same as the native isNaN function, which will also return true if the variable is undefined.",
          "alias": []
        },
        {
          "title": "isNull",
          "code": "_.isNull(object)",
          "description": " Returns true if the value of object is null.",
          "alias": []
        },
        {
          "title": "isUndefined",
          "code": "_.isUndefined(value)",
          "description": " Returns true if value is undefined.",
          "alias": []
        }
      ]
    },
    {
      "title": "Utility",
      "items": [
        {
          "title": "noConflict",
          "code": "_.noConflict()",
          "description": " Give control of the \"_\" variable back to its previous owner. Returns a reference to the Underscore object.",
          "alias": []
        },
        {
          "title": "identity",
          "code": "_.identity(value)",
          "description": " Returns the same value that is used as the argument. In math: f(x) = x This function looks useless, but is used throughout Underscore as a default iterator.",
          "alias": []
        },
        {
          "title": "times",
          "code": "_.times(n, iterator, [context])",
          "description": " Invokes the given iterator function n times. Each invocation of iterator is called with an index argument.Note: this example uses the chaining syntax.",
          "alias": []
        },
        {
          "title": "random",
          "code": "_.random(min, max)",
          "description": " Returns a random integer between min and max, inclusive. If you only pass one argument, it will return a number between 0 and that number.",
          "alias": []
        },
        {
          "title": "mixin",
          "code": "_.mixin(object)",
          "description": " Allows you to extend Underscore with your own utility functions. Pass a hash of {name: function} definitions to have your functions added to the Underscore object, as well as the OOP wrapper.",
          "alias": []
        },
        {
          "title": "uniqueId",
          "code": "_.uniqueId([prefix])",
          "description": " Generate a globally-unique id for client-side models or DOM elements that need one. If prefix is passed, the id will be appended to it.",
          "alias": []
        },
        {
          "title": "escape",
          "code": "_.escape(string)",
          "description": " Escapes a string for insertion into HTML, replacing &amp;, &lt;, &gt;, \", ', and / characters.",
          "alias": []
        },
        {
          "title": "unescape",
          "code": "_.unescape(string)",
          "description": " The opposite of escape, replaces &amp;amp;, &amp;lt;, &amp;gt;, &amp;quot;, &amp;#x27;, and &amp;#x2F; with their unescaped counterparts.",
          "alias": []
        },
        {
          "title": "result",
          "code": "_.result(object, property)",
          "description": " If the value of the named property is a function then invoke it; otherwise, return it.",
          "alias": []
        },
        {
          "title": "template",
          "code": "_.template(templateString, [data], [settings])",
          "description": " Compiles JavaScript templates into functions that can be evaluated for rendering. Useful for rendering complicated bits of HTML from JSON data sources. Template functions can both interpolate variables, using &lt;%= … %&gt;, as well as execute arbitrary JavaScript code, with &lt;% … %&gt;. If you wish to interpolate a value, and have it be HTML-escaped, use &lt;%- … %&gt; When you evaluate a template function, pass in a data object that has properties corresponding to the template's free variables. If you're writing a one-off, you can pass the data object as the second parameter to template in order to render immediately instead of returning a template function. The settings argument should be a hash containing any _.templateSettings that should be overridden.",
          "alias": []
        }
      ]
    },
    {
      "title": "Chaining",
      "description": "Wrap objects so that they can be chained for use with underscore",
      "items": [
        {
          "title": "chain",
          "code": "_.chain(obj)",
          "description": " Returns a wrapped object. Calling methods on this object will continue to return wrapped objects until value is used.",
          "alias": []
        },
        {
          "title": "value",
          "code": "_(obj).value()",
          "description": " Extracts the value of a wrapped object.",
          "alias": []
        }
      ]
    }
  ]
}